/*Абельтин С.А. 41ИС-21
3.19. Методы, возникающие неявно
Задача: Объяснить, какие методы компилятор может создать неявно и показать пример с неявным конструктором копирования.*/

#include <iostream>

class AutoGenerated {
public:
    int value;
};

int main() {
    AutoGenerated obj1; // Используется конструктор по умолчанию
    obj1.value = 42;
    
    AutoGenerated obj2 = obj1; // Используется неявный конструктор копирования
    std::cout << "obj2.value: " << obj2.value << std::endl;
    return 0;
}

/*Компилятор C++ может автоматически генерировать:
Конструктор по умолчанию.
Конструктор копирования.
Оператор присваивания.
Деструктор.
Если эти методы не определены пользователем, компилятор создаёт их автоматически.*/
